# DS_IsUnderCanopy

## Description
Returns whether document shadow is under Canopy.

```pascal
FUNCTION DS_IsUnderCanopy : BOOLEAN;
```

```python

def vs.DS_IsUnderCanopy():
    return BOOLEAN
```

## Version
Availability: from Vectorworks 2017
## Category
* Document Attributes